{
  "id": "threestorm_triplepyramid_varies",
  "name": "Three Storm Triple Pyramid (Varies)",
  "author_source": "Three Storm Fitness (adapted from Stew Smith PT Pyramid)",
  "cycle_duration": "varies",
  "total_sets": "varies",
  "reps": "varies",
  "intensity_unit": "N/A",
  "intensity_range": "N/A",
  "avg_time_session": 45,
  "time_per_session_breakdown": "10 steps up and down with minimal rest between exercises, ~2 seconds per rep, 15 seconds between exercises, and 1-minute rest at pyramid peak",
  "amrap": "no",
  "timed": "no",
  "emom": "no",
  "train_to_failure": "varies",
  "superset_type": "circuit",
  "spec_movement": "open",
  "autoregulated": "yes",
  "drop_sets": "no",
  "rest_pause": "no",
  "cluster": "no",
  "tempo_spec": "no",
  "wave_sets": "no",
  "ladder_sets": "pyramid",
  "density_sets": "no",
  "straight_sets": "no",
  "contrast_sets": "no",
  "total_rep_target": "n/a",
  "deload": "no",
  "overview_and_execution": "The Three Storm Triple Pyramid is a bodyweight or mixed-modality workout involving three distinct exercises with varied rep multipliers. You start at 1 rep for the first exercise, 2 for the second, and 3 for the third, increasing each step until reaching a peak (ideally step 10), then descend back to 1. Start with a 1-6-1 pyramid structure and progressively work up to 1-10-1.",
  "example_application": "An intermediate trainee might select Ring Pullups x1, Ring Dips x2, and Kettlebell Swings x3. On step 1, they perform 1 pullup, 2 dips, and 3 swings. By step 6, they complete 6 pullups, 12 dips, and 18 swings, before reversing back down to step 1.",
  "important_notes": "Mix and match exercises based on your goals and fitness level. Ensure the chosen movements have compatible difficulty levels to maintain intensity without overtraining. Avoid combining heavy spine-loaded exercises with core-centric movements to ensure proper bracing.",
  "volume_metrics": "1x exercises: 36-100 reps, 2x exercises: 72-200 reps, 3x exercises: 108-300 reps depending on pyramid steps completed."
}
